{
    "add-item": "Add Item",
    "enabled": "Enabled",
    "error.username-too-similar": "The username is too similar to existing user %1",
    "error.invalid-username": "The username is invalid",
    "error.username-taken": "The username is already taken",
    "error.username-blacklisted": "The username contains a blacklisted word or pattern",
    "error.special-characters": "The username can't contain special characters",
    "error.no-letters": "The username must contain at least one letter",
    "filter.duplicate.name": "Don't allow duplicate usernames",
    "filter.duplicate.description": "If enabled, registering with a taken username (different case or special characters, but same slug) will throw an error instead of adding a number",
    "filter.onlyAlphabetic.name": "Don't allow usernames without any letters",
    "filter.onlyAlphabetic.description": "If enabled, registering with a username that contains no letters (eg. just numbers) will be rejected. Note that this is using Unicode Alphabetic property, so it may allow more characters than you expect.",
    "filter.onlyAlphaNumeric.name": "Only allow alphanumeric characters (+spaces) in usernames",
    "filter.onlyAlphaNumeric.description": "If enabled, registering with a username that contains non-alphanumeric characters (special characters, emojis, weird whitespace) will be rejected. Note that this uses Unicode definition of alphanumerc which may contain more symbols that you expect.",
    "filter.similarity.name": "Maximum similarity to existing usernames",
    "filter.similarity.description": "If enabled, registering with a username that is too similar to an existing username will be rejected. This is calculated using Sørensen-Dice coefficient of these two usernames. The value is the maximum similarity allowed, so 85 means that usernames with coeffient of 0.85 or more will be rejected. Warning: setting this too low will cause a lot of false positives.",
    "filter.regex.name": "Custom blacklist (words or regex)",
    "filter.regex.description": "If enabled, registering with a username that matches any of the rules will be rejected. Rules are matched using JavaScript regex, but for basic usage just inputting the word will match it as is. Just be weary of special characters like parentheses or periods, which need to be escaped by prepending them with \\",
    "groups-checked": "Checked Groups",
    "groups-checked-description": "If any groups is selected here, similarity checks will only compare new usernames to their members",
    "insensitive": "(case insensitive)",
    "rules": "Rules"
}